## 3. Azure SQL Database
<br>

[공식 문서](https://learn.microsoft.com/en-us/azure/mysql/single-server/connect-python) 확인할 것

In [1]:
import pymysql

In [9]:
# 접속하기 위한 정보 입력
host_name = 'xxxxxxxxxxxxxx' # Azure SQL의 서버 이름
user_name = 'xxxxxxxxxxxxxx' # Azure SQL의 서버 관리자 로그인 이름
password  = 'xxxxxxxxxxxxxx' # 패스워드
database_name = 'xxxxxxxxxx' # Workbench의 database이름

#### Database 연결하기

In [14]:
# 먼저 Azure SQL >> 네트워킹 >> 방화벽을 추가하여 Jupyter notebook에서 접근할 수 있게 해줌
db = pymysql.connect(
    host    = host_name,
    port    = 3306,        # 지정안하면 default 3306
    user    = user_name,
    passwd  = password,
    db      = database_name,
    charset = 'utf8',
    ssl={"fake_flag_to_enable_tls":True}
)

In [15]:
import pandas as pd

In [17]:
# 읽어오기
SQL_QUERY = 'SELECT * FROM employees'

df = pd.read_sql(SQL_QUERY, db)
df.head()

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

#### CREATE table

In [24]:
SQL_QUERY = '''
CREATE TABLE tempTable(
  id TINYINT NOT NULL AUTO_INCREMENT,
  user_name varchar(10) NOT NULL,
  phone varchar(30) NULL,
  PRIMARY KEY(id)
)
'''

cursor = db.cursor()
cursor.execute(SQL_QUERY)
cursor.close()

#### INSERT data on table

In [26]:
SQL_QUERY = "INSERT INTO tempTable(user_name,phone) VALUES('oh my girl','010-0000-0000')"

cursor = db.cursor()
cursor.execute(SQL_QUERY)
cursor.close()

#### SELECT data on table

In [27]:
SQL_QUERY = 'SELECT * FROM tempTable'
df = pd.read_sql(SQL_QUERY, db)
df.head()

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id   user_name          phone
0   1  oh my girl  010-0000-0000